[{"client_msg_id":"4cee8283-b750-499d-8ce1-020ef78cdef6","type":"message","text":"Hi there, I'm Yosef Velazquez, student on Computer Science master here in México :flag-mx:. I'm still very naive with Julia, but the language has catched my breath, I would like to improve Julia library in probabilistic resources, specifically Graphical Probabilistics Models, which is a one of my research fields. Just a Quick Question, Julia webpage guideline says we are encouraged to contact our proposed mentor, but I wasn't able to find any section for mentors listing and contact information.  Do I start my draft proposal on Google Docs or do I have to wait for a mentor?","user":"U01TYDBP16Y","ts":"1617940117.175200","team":"T68168MUP","blocks":[{"type":"rich_text","block_id":"7CBd","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"Hi there, I'm Yosef Velazquez, student on Computer Science master here in México "},{"type":"emoji","name":"flag-mx"},{"type":"text","text":". I'm still very naive with Julia, but the language has catched my breath, I would like to improve Julia library in probabilistic resources, specifically Graphical Probabilistics Models, which is a one of my research fields. Just a Quick Question, Julia webpage guideline says we are encouraged to contact our proposed mentor, but I wasn't able to find any section for mentors listing and contact information.  Do I start my draft proposal on Google Docs or do I have to wait for a mentor?"}]}]}],"thread_ts":"1617940117.175200","reply_count":1,"reply_users_count":1,"latest_reply":"1617940308.176200","reply_users":["UGR3910CQ"],"is_locked":false,"subscribed":false},{"client_msg_id":"4C23F351-D918-48D0-8D5A-48F374EC6648","type":"message","text":"Can you like the project you are referring too? There should be a project mentor listed. ","user":"UGR3910CQ","ts":"1617940308.176200","team":"T68168MUP","blocks":[{"type":"rich_text","block_id":"Tb1","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"Can you like the project you are referring too? There should be a project mentor listed. "}]}]}],"thread_ts":"1617940117.175200","parent_user_id":"U01TYDBP16Y"}]