[{"type":"message","subtype":"bot_message","text":"Hi all, I have a somewhat odd question on an unusual use of JuMP. So I understand if the answer is “no we can’t do that”. When building large Power Systems problems there is the potential for the model to have bad scaling. Actually it is common to have bad scaling. Many tools do automatic rescaling like Plexos or RPM, but they do it directly on the A matrix before is sent to the solver.   The best thing for us to maintain solver independent modeling would be to resolve this in JuMP. Is there anyway in JuMP to diagnose and potentially resolve scaling problems in the cached problem before it is sent to the solver? Or any ideas to implement at least a check of potential scaling problems? ","ts":"1616693809.046900","username":"[gitter] <jd-lara>","bot_id":"B795XHD0X","thread_ts":"1616693809.046900","reply_count":1,"reply_users_count":1,"latest_reply":"1616693849.047000","reply_users":["UCT7E536E"],"is_locked":false,"subscribed":false,"blocks":[{"type":"section","block_id":"matterbridge_c175804g27iaek8aehs0","text":{"type":"mrkdwn","text":"Hi all, I have a somewhat odd question on an unusual use of JuMP. So I understand if the answer is “no we can’t do that”. When building large Power Systems problems there is the potential for the model to have bad scaling. Actually it is common to have bad scaling. Many tools do automatic rescaling like Plexos or RPM, but they do it directly on the A matrix before is sent to the solver. \n\nThe best thing for us to maintain solver independent modeling would be to resolve this in JuMP. Is there anyway in JuMP to diagnose and potentially resolve scaling problems in the cached problem before it is sent to the solver? Or any ideas to implement at least a check of potential scaling problems? ","verbatim":false}}]},{"client_msg_id":"9ce0ec84-e3bd-4468-b7ed-d6f36cf992b8","type":"message","text":"You mean like some very small coefficients and other very large?","user":"UCT7E536E","ts":"1616693849.047000","team":"T68168MUP","blocks":[{"type":"rich_text","block_id":"AX+u","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"You mean like some very small coefficients and other very large?"}]}]}],"thread_ts":"1616693809.046900"}]