[{"client_msg_id":"dea40fa7-1e58-4f90-86e4-96b1b7c07cbf","type":"message","text":"Thoughts on the frankfurt school?","user":"UDGT4PM41","ts":"1617599360.489800","team":"T68168MUP","blocks":[{"type":"rich_text","block_id":"L8D","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"Thoughts on the frankfurt school?"}]}]}],"thread_ts":"1617599360.489800","reply_count":7,"reply_users_count":5,"latest_reply":"1617637593.007800","reply_users":["U017E1DLS6B","U881D0W2C","UP9P4JFNJ","UNWE8FN65","U011V2YN59N"],"is_locked":false,"subscribed":false,"reactions":[{"name":"thinking_face","users":["U01HFCRH5ML"],"count":1},{"name":"wat","users":["UPUBAM63X"],"count":1},{"name":"+1","users":["U011V2YN59N"],"count":1}]},{"client_msg_id":"10f4f98e-2ff2-4d68-85ee-5c136b0a8329","type":"message","text":"What's the Frankfurt school?","user":"U017E1DLS6B","ts":"1617602986.490200","team":"T68168MUP","blocks":[{"type":"rich_text","block_id":"Cy=","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"What's the Frankfurt school?"}]}]}],"thread_ts":"1617599360.489800","parent_user_id":"UDGT4PM41"},{"client_msg_id":"6979f6fa-6d6e-4e69-a3aa-0dc08292b9c7","type":"message","text":"<https://en.wikipedia.org/wiki/Frankfurt_School>","user":"U881D0W2C","ts":"1617607884.490500","team":"T68168MUP","attachments":[{"image_url":"https://upload.wikimedia.org/wikipedia/commons/c/c3/AdornoHorkheimerHabermasbyJeremyJShapiro2.png","image_width":1067,"image_height":696,"image_bytes":496487,"title":"Frankfurt School","title_link":"https://en.wikipedia.org/wiki/Frankfurt_School","from_url":"https://en.wikipedia.org/wiki/Frankfurt_School","author_name":"Wikipedia","author_link":"https://en.wikipedia.org/","text":"The Frankfurt School (German: Frankfurter Schule) was a school of social theory and critical philosophy associated with the Institute for Social Research, at Goethe University Frankfurt. Founded in the Weimar Republic (1918–33), during the European interwar period (1918–39), the Frankfurt School comprised intellectuals, academics, and political dissidents dissatisfied with the contemporary socio-economic systems (capitalist, fascist, communist) of the 1930s. The Frankfurt theorists proposed that social theory was inadequate for explaining the turbulent political factionalism and reactionary politics occurring in 20th century liberal capitalist societies. Critical of capitalism and of Marxism–Leninism as philosophically inflexible systems of social organization, the School's critical theory research indicated alternative paths to realizing the social development of a society and a nation.The Frankfurt School perspective of critical investigation (open-ended and self-critical) is based upon Freudian, Marxist and Hegelian premises of idealist philosophy. To fill the omissions of 19th-century classical Marxism, which did not address 20th-century social problems, they applied the methods of antipositivist sociology, of psychoanalysis, and of existentialism. The School's sociologic works derived from syntheses of the thematically pertinent works of Immanuel Kant, Georg Wilhelm Friedrich Hegel, and Karl Marx, of Sigmund Freud and Max Weber, and of Georg Simmel and Georg Lukács.Like Karl Marx, the Frankfurt School concerned themselves with the conditions (political, economic, societal) that allow for social change realized by way of rational social institutions. Their emphasis on the critical component of social theory derived from their attempts to overcome the ideological limitations of positivism, materialism, and determinism by returning to the critical philosophy of Kant and his successors in German idealism – principally the philosophy of Hegel, which emphasized dialectic and contradiction as intellectual properties inherent to the human grasp of material reality.\nSince the 1960s, the critical-theory work of the Institute for Social Research has been guided by Jürgen Habermas's work in communicative rationality, linguistic intersubjectivity, and \"the philosophical discourse of modernity.\" Critical theorists Raymond Geuss and Nikolas Kompridis have opposed Habermas's propositions, claiming he has undermined the original social-change purposes of critical-theory-problems, such as what should reason mean; analysis of the conditions necessary to realize social emancipation; and critiques of contemporary capitalism.","fallback":"wikipedia: Frankfurt School","service_icon":"https://a.slack-edge.com/80588/img/unfurl_icons/wikipedia.png","id":1,"original_url":"https://en.wikipedia.org/wiki/Frankfurt_School"}],"blocks":[{"type":"rich_text","block_id":"7tA","elements":[{"type":"rich_text_section","elements":[{"type":"link","url":"https://en.wikipedia.org/wiki/Frankfurt_School"}]}]}],"thread_ts":"1617599360.489800","parent_user_id":"UDGT4PM41"},{"client_msg_id":"24a0288e-c1ad-41b9-83df-548fbd87debd","type":"message","text":"I was born in Frankfurt :)","user":"U881D0W2C","ts":"1617607919.490800","team":"T68168MUP","edited":{"user":"U881D0W2C","ts":"1617607934.000000"},"blocks":[{"type":"rich_text","block_id":"rhha","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"I was born in Frankfurt :)"}]}]}],"thread_ts":"1617599360.489800","parent_user_id":"UDGT4PM41"},{"client_msg_id":"59a6d19a-2b9f-40a7-b468-db866cbdc346","type":"message","text":"Haha I live about 40 minutes north of it. Hadn't heard of it","user":"U017E1DLS6B","ts":"1617608222.491200","team":"T68168MUP","blocks":[{"type":"rich_text","block_id":"YJtR","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"Haha I live about 40 minutes north of it. Hadn't heard of it"}]}]}],"thread_ts":"1617599360.489800","parent_user_id":"UDGT4PM41"},{"client_msg_id":"52b27340-5303-4977-9462-05637c5867bc","type":"message","text":"The students movement 1968 was very much influenced by it (Rudi Dutschke had studied the so-called <https://de.wikipedia.org/wiki/Kritische_Theorie|kritische Theorie>). I remember mostly the names of people like Adorno or Marcuse. At that time I was a child and didn’t understand it. The latter did not change much since then (even if as a student later I read Fromm or Walter Benjamin).\n\nI understand that their stuff is still very much rooted in German Idealism.","user":"UP9P4JFNJ","ts":"1617611930.491700","team":"T68168MUP","attachments":[{"image_url":"https://upload.wikimedia.org/wikipedia/commons/c/c3/AdornoHorkheimerHabermasbyJeremyJShapiro2.png","image_width":1067,"image_height":696,"image_bytes":496487,"title":"Kritische Theorie","title_link":"https://de.wikipedia.org/wiki/Kritische_Theorie","from_url":"https://de.wikipedia.org/wiki/Kritische_Theorie","author_name":"Wikipedia","author_link":"https://de.wikipedia.org/","text":"Als Kritische Theorie wird eine von Hegel, Marx und Freud in der ersten Hälfte des 20. Jahrhunderts inspirierte Gesellschaftstheorie bezeichnet, deren Vertreter (vornehmlich Max Horkheimer, Theodor W. Adorno, Herbert Marcuse und der Sozialpsychologe Erich Fromm) auch unter dem Begriff Frankfurter Schule zusammengefasst werden und die im Institut für Sozialforschung ihr institutionelles Zentrum und in der Zeitschrift für Sozialforschung ihr publizistisches Organ hatten. Aus dem assoziierten Wirkungskreis von Autoren und Rezensenten bildete der Philosoph und Kulturtheoretiker Walter Benjamin die bedeutsamste Inspirationsquelle für die theoretischen Konstruktionen der Schule.\nGegenstand der Theorie ist die ideologiekritische Analyse der bürgerlich-kapitalistischen Gesellschaft, das heißt: die Aufdeckung ihrer Herrschafts- und Unterdrückungsmechanismen und die Hinterfragung ihrer Ideologien, mit dem Ziel einer vernünftigen Gesellschaft mündiger Menschen. Ihr Anspruch ist, die Totalität der gesellschaftlichen Verhältnisse und die Notwendigkeit ihrer Veränderung theoretisch darzulegen. Ihre Begriffe beschreiben, was ist, und antizipieren, was sein soll oder sein könnte. Wenn Theorie in diesem Verständnis als eine Form der Praxis begriffen wird – „Denken ist ein Tun“ (Adorno) –, heißt das: Mit der theoretischen Aufklärung werden die gesellschaftlichen Verhältnisse entschleiert, und mit dem neuen Blick auf sie beginnt die verändernde Praxis im Bewusstsein der aufgeklärten Menschen. Stand an ihrem Anfang das Projekt einer sozialwissenschaftlichen, interdisziplinären Zeitdiagnose mit emanzipatorischem Anspruch, so veränderte sie sich, unter dem Einfluss der zeitgeschichtlichen Ereignisse (Weltwirtschaftskrise, Krise der liberalen Demokratien, Aufkommen diktatorischer Regime, Zweiter Weltkrieg, Expansion der Kulturindustrie), in eine negative Geschichtsphilosophie ohne Hoffnung auf absehbare Umgestaltung der „totalitär“ (Horkheimer/Adorno) und „eindimensional“ (Marcuse) gewordenen gesellschaftlichen Verhältnisse.\nVon dieser „älteren“ oder „klassischen“ Kritischen Theorie, die hier fokussiert wird, ist die auf Jürgen Habermas zurückgehende „jüngere“ Kritische Theorie zu unterscheiden, die an den gesellschaftskritischen Motiven zwar festhält, aber die radikale Vernunftskepsis und die pessimistische Geschichtskonstruktion verwirft und mit dem Begriff der „kommunikativen Vernunft“ emanzipatorische Motive ins Zentrum der Theorie rückt. Zu beobachten ist auch, dass in anderen Wissenschaftsgebieten, vornehmlich im englischsprachigen Bereich, Theorieansätze mit dem Attribut „Kritisch“ bzw. \"kritisch\" versehen werden, z. B. Kritische Geographie oder Kritische Kriminologie, die ähnlich wie die hier dargestellte Theorie ihr spezifisches Wissensgebiet aus gesellschaftskritischer Perspektive erforschen.","fallback":"wikipedia: Kritische Theorie","service_icon":"https://a.slack-edge.com/80588/img/unfurl_icons/wikipedia.png","id":1,"original_url":"https://de.wikipedia.org/wiki/Kritische_Theorie"}],"blocks":[{"type":"rich_text","block_id":"AquAF","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"The students movement 1968 was very much influenced by it (Rudi Dutschke had studied the so-called "},{"type":"link","url":"https://de.wikipedia.org/wiki/Kritische_Theorie","text":"kritische Theorie"},{"type":"text","text":"). I remember mostly the names of people like Adorno or Marcuse. At that time I was a child and didn’t understand it. The latter did not change much since then (even if as a student later I read Fromm or Walter Benjamin).\n\nI understand that their stuff is still very much rooted in German Idealism."}]}]}],"thread_ts":"1617599360.489800","parent_user_id":"UDGT4PM41"},{"client_msg_id":"E47CA734-FCB1-4952-99A9-0BC03CDADCD3","type":"message","text":"Hi, In case you want to devote 4 hours to the subject, in French....\n<https://www.franceculture.fr/emissions/series/lecole-de-francfort>","user":"UNWE8FN65","ts":"1617613681.492000","team":"T68168MUP","attachments":[{"service_name":"France Culture","title":"L’École de Francfort – série de podcasts à écouter – France Culture","title_link":"https://www.franceculture.fr/emissions/series/lecole-de-francfort","text":"Theodor W . Adorno, Walter Benjamin, Max Horkheimer, Herbert Marcuse, puis Jürgen Habermas : voici les philosophes et intellectuels qui nous accompagn...","fallback":"France Culture: L’École de Francfort – série de podcasts à écouter – France Culture","image_url":"https://cdn.radiofrance.fr/s3/cruiser-production/2019/11/f458ccf9-52a4-41da-b1a4-c92cee907d79/838_838_adornohorkheimerhabermasbyjeremyjshapiro2.jpg","image_width":384,"image_height":250,"from_url":"https://www.franceculture.fr/emissions/series/lecole-de-francfort","image_bytes":58389,"service_icon":"https://www.franceculture.fr/favicons/apple-icon-57x57.png","id":1,"original_url":"https://www.franceculture.fr/emissions/series/lecole-de-francfort"}],"thread_ts":"1617599360.489800","parent_user_id":"UDGT4PM41"},{"client_msg_id":"9917ed52-24be-44c9-be06-8ce0927b986f","type":"message","text":"I really liked Adorno's minima moralia, but I haven't read any of the others' work.","user":"U011V2YN59N","ts":"1617637593.007800","team":"T68168MUP","blocks":[{"type":"rich_text","block_id":"5+n/g","elements":[{"type":"rich_text_section","elements":[{"type":"text","text":"I really liked Adorno's minima moralia, but I haven't read any of the others' work."}]}]}],"thread_ts":"1617599360.489800","parent_user_id":"UDGT4PM41"}]